In [4]:
def my_sq(x):
    return x ** 2

In [5]:
def my_ex(x,n):
    return x **n

In [8]:
print(my_sq(2))
print(my_ex(3,4))

4
81

In [9]:
import pandas as pd

In [10]:
df= pd.DataFrame({'a': [10,20,30],'b':[20,30,40]})
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [11]:
sq =df['a'].apply(my_sq)
print(sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [13]:
df['a'].apply(lambda x : x**2)

0    100
1    400
2    900
Name: a, dtype: int64

In [18]:
ex = df['a'].apply(my_ex,n=2)
ex

0    100
1    400
2    900
Name: a, dtype: int64

In [20]:
df['a'].apply(lambda x,n : x**n,n=2)

0    100
1    400
2    900
Name: a, dtype: int64

In [23]:
def print_me(x):
    print(x)

In [26]:
df.apply(print_me,axis=0)
df.apply(print_me,axis=1)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [29]:
df.apply(lambda x : print(x),axis=0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [30]:
df['a+b'] = df.apply(lambda x : x['a']+x['b'],axis=1)

In [31]:
df

    a   b  a+b
0  10  20   30
1  20  30   50
2  30  40   70

In [34]:
def avg_3(x,y,z):
    return (x+y+z)/3
print(df.apply(avg_3,y=1,z=2))

           a          b        a+b
0   4.333333   7.666667  11.000000
1   7.666667  11.000000  17.666667
2  11.000000  14.333333  24.333333

In [35]:
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x+y+z)/3
print(df.apply(avg_3_apply))

a      20.0
b      30.0
a+b    50.0
dtype: float64

In [36]:
## apply 실제 사용

In [37]:
import seaborn as sns

In [39]:
titanic = sns.load_dataset('titanic')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [40]:
import numpy as np  ##함수를 만들어 어플라이함수에 적용

In [47]:
def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [48]:
cmis_col = titanic.apply(count_missing)
print(cmis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [49]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num / dem

In [50]:
pmis_col=titanic.apply(prop_missing)
pmis_col

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [51]:
def prop_complete(vec):
    return 1-prop_missing(vec)

In [61]:
titanic['num_missing']=titanic.apply(count_missing,axis=1)
titanic.iloc[:5,list(range(11))+[-1]]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,1

In [62]:
##데이터 집계

In [63]:
df=pd.read_csv('./data/gapminder.tsv',sep='\t')

In [64]:
avg_life_exp_by_year =df.groupby('year').lifeExp.mean()

In [65]:
print(avg_life_exp_by_year)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [66]:
years=df.year.unique()
print(years)

[1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 2002 2007]

In [72]:
year_means =[]
for y in years:
    m = df.loc[df.year ==y,:].lifeExp.mean()
    year_means.append((y,m))
print(year_means)

[(1952, 49.05761971830987), (1957, 51.507401126760534), (1962, 53.60924901408449), (1967, 55.67828957746479), (1972, 57.647386478873244), (1977, 59.57015746478873), (1982, 61.53319718309858), (1987, 63.21261267605636), (1992, 64.16033802816901), (1997, 65.01467605633805), (2002, 65.69492253521126), (2007, 67.00742253521126)]

In [74]:
df2=pd.DataFrame({
    'year' : [y for y,m in year_means],
    '' : [m for y,m in year_means]
})

In [75]:
df2

    year
0   1952  49.057620
1   1957  51.507401
2   1962  53.609249
3   1967  55.678290
4   1972  57.647386
5   1977  59.570157
6   1982  61.533197
7   1987  63.212613
8   1992  64.160338
9   1997  65.014676
10  2002  65.694923
11  2007  67.007423

In [89]:
def my_mean(values):
    n = len(values)
    sum= 0
    for value in values:
        sum += value
    return sum/n

In [90]:
df.groupby('year').lifeExp.agg(my_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [96]:
def my_mean_diff(values,diff_value):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    mean = sum / n
    return mean - diff_value

In [97]:
global_mean = df.lifeExp.mean()
print(global_mean)

59.47443936619714

In [98]:
agg_mean_diff= df.groupby('year').lifeExp.agg(my_mean_diff,diff_value=global_mean)
agg_mean_diff

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [99]:
import numpy as np

In [101]:
gdf = df.groupby('year').lifeExp.agg([np.count_nonzero, np.mean,np.std])
gdf

      count_nonzero       mean        std
year
1952            142  49.057620  12.225956
1957            142  51.507401  12.231286
1962            142  53.609249  12.097245
1967            142  55.678290  11.718858
1972            142  57.647386  11.381953
1977            142  59.570157  11.227229
1982            142  61.533197  10.770618
1987            142  63.212613  10.556285
1992            142  64.160338  11.227380
1997            142  65.014676  11.559439
2002            142  65.694923  12.279823
2007            142  67.007423  12.073021

In [103]:
gdf_dict = df.groupby('year').agg(
{'lifeExp':'mean','pop':'median','gdpPercap':'median'})
gdf_dict

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334740
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371108

In [104]:
def my_zscore(x):
    return (x-x.mean())/x.std()

In [106]:
transtorm_z = df.groupby('year').lifeExp.transform(my_zscore)
transtorm_z.head()

0   -1.656854
1   -1.731249
2   -1.786543
3   -1.848157
4   -1.894173
Name: lifeExp, dtype: float64

In [107]:
np.random.seed(42)

In [109]:
tips_10=sns.load_dataset('tips').sample(10)
tips_10.loc[np.random.permutation(tips_10.index)[:4],'total_bill']=np.NaN
tips_10

     total_bill   tip     sex smoker   day    time  size
58        11.24  1.76    Male    Yes   Sat  Dinner     2
73          NaN  5.00  Female    Yes   Sat  Dinner     2
138       16.00  2.00    Male    Yes  Thur   Lunch     2
193       15.48  2.02    Male    Yes  Thur   Lunch     2
235       10.07  1.25    Male     No   Sat  Dinner     2
117         NaN  1.50  Female     No  Thur   Lunch     2
154       19.77  2.00    Male     No   Sun  Dinner     4
55        19.49  3.51    Male     No   Sun  Dinner     2
87          NaN  4.00    Male     No  Thur   Lunch     2
9           NaN  3.23    Male     No   Sun  Dinner     2

In [113]:
def fill_na_mean(x):
    avg=x.mean()
    return x.fillna(avg)

In [115]:
tb_grp_mean=tips_10.groupby('sex').total_bill.transform(fill_na_mean)
tips_10['fill_total_bill']=tb_grp_mean
tips_10

     total_bill   tip     sex smoker   day    time  size  fill_total_bill
58        11.24  1.76    Male    Yes   Sat  Dinner     2        11.240000
73          NaN  5.00  Female    Yes   Sat  Dinner     2              NaN
138       16.00  2.00    Male    Yes  Thur   Lunch     2        16.000000
193       15.48  2.02    Male    Yes  Thur   Lunch     2        15.480000
235       10.07  1.25    Male     No   Sat  Dinner     2        10.070000
117         NaN  1.50  Female     No  Thur   Lunch     2              NaN
154       19.77  2.00    Male     No   Sun  Dinner     4        19.770000
55        19.49  3.51    Male     No   Sun  Dinner     2        19.490000
87          NaN  4.00    Male     No  Thur   Lunch     2        15.341667
9           NaN  3.23    Male     No   Sun  Dinner     2        15.341667

In [116]:
def plus(value):
    return value +2
df = pd.DataFrame({'a':[10,20,30],'b':[20,30,40]})

In [117]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [121]:
def mean(x):
    return x.mean()

#df.aply(mean)
df.agg(mean)
#어플라이는 데이터프레임만가능

a    20.0
b    30.0
dtype: float64

In [123]:
df2 = pd.DataFrame({
    'a' : [10,20,30,40],
    'b' : [20,30,40,50],
    'c' : ['서울','대전','부산','제주'],
    'd' : ['Female','Male','Male','Female']
})

In [124]:
df2

    a   b   c       d
0  10  20  서울  Female
1  20  30  대전    Male
2  30  40  부산    Male
3  40  50  제주  Female

In [125]:
df2.apply(mean)

TypeError: Could not convert 서울대전부산제주 to numeric

In [126]:
df2.agg(mean)

TypeError: Could not convert 서울대전부산제주 to numeric

In [127]:
df2.transform(mean)

C:\Users\admin\AppData\Local\Temp\ipykernel_4016\1339436133.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return x.mean()

ValueError: Function did not transform

In [128]:
df2_grp = df2.groupby('c')

In [130]:
df2_grp.transform(plus)

C:\Users\admin\AppData\Local\Temp\ipykernel_4016\2023193151.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.transform is deprecated. In a future version, a TypeError will be raised. Before calling .transform, select only columns which should be valid for the function.
  df2_grp.transform(plus)

    a   b
0  12  22
1  22  32
2  32  42
3  42  52

In [131]:
df2_grp.apply(mean)
df2_grp.agg(mean)

C:\Users\admin\AppData\Local\Temp\ipykernel_4016\1339436133.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return x.mean()
C:\Users\admin\AppData\Local\Temp\ipykernel_4016\3577250213.py:2: FutureWarning: ['d'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df2_grp.agg(mean)

       a     b
c
대전  20.0  30.0
부산  30.0  40.0
서울  10.0  20.0
제주  40.0  50.0

In [1]:
import seaborn as sns

In [3]:
tips = sns.load_dataset('tips')

In [5]:
print(tips.shape)

(244, 7)

In [7]:
print(tips['size'].value_counts())  #size 열의 데이터 빈도 확인

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

In [8]:
tips_filtered = tips.groupby('size').filter(
lambda x : x['size'].count()>=30)
print(tips_filtered.shape)

(231, 7)

In [10]:
print(tips_filtered['size'].value_counts())

2    156
3     38
4     37
Name: size, dtype: int64

In [11]:
##그룹오브젝트

In [16]:
import numpy as np

In [14]:
tips_10 = sns.load_dataset('tips').sample(10)

In [17]:
np.random.seed(1234)

In [18]:
print(tips_10)

     total_bill   tip     sex smoker   day    time  size
173       31.85  3.18    Male    Yes   Sun  Dinner     2
80        19.44  3.00    Male    Yes  Thur   Lunch     2
42        13.94  3.06    Male     No   Sun  Dinner     2
56        38.01  3.00    Male    Yes   Sat  Dinner     4
13        18.43  3.00    Male     No   Sun  Dinner     4
53         9.94  1.56    Male     No   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
81        16.66  3.40    Male     No  Thur   Lunch     2
100       11.35  2.50  Female    Yes   Fri  Dinner     2
84        15.98  2.03    Male     No  Thur   Lunch     2

In [25]:
tips_10=tips.sample(10,random_state=1234)

In [23]:
grouped = tips_10.groupby('smoker')
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002596F40B2B0>

In [24]:
print(grouped.groups)

{'Yes': [173, 80, 56, 192, 100], 'No': [42, 13, 53, 81, 84]}

In [26]:
avgs = grouped.mean()
avgs

        total_bill    tip  size
smoker
Yes         25.818  2.848   2.4
No          14.990  2.610   2.4

In [27]:
yes = grouped.get_group('Yes')

In [28]:
print(yes)

     total_bill   tip     sex smoker   day    time  size
173       31.85  3.18    Male    Yes   Sun  Dinner     2
80        19.44  3.00    Male    Yes  Thur   Lunch     2
56        38.01  3.00    Male    Yes   Sat  Dinner     4
192       28.44  2.56    Male    Yes  Thur   Lunch     2
100       11.35  2.50  Female    Yes   Fri  Dinner     2

In [34]:
for smoke_group in grouped:
    print(smoke_group)

('Yes',      total_bill   tip     sex smoker   day    time  size
173       31.85  3.18    Male    Yes   Sun  Dinner     2
80        19.44  3.00    Male    Yes  Thur   Lunch     2
56        38.01  3.00    Male    Yes   Sat  Dinner     4
192       28.44  2.56    Male    Yes  Thur   Lunch     2
100       11.35  2.50  Female    Yes   Fri  Dinner     2)
('No',     total_bill   tip   sex smoker   day    time  size
42       13.94  3.06  Male     No   Sun  Dinner     2
13       18.43  3.00  Male     No   Sun  Dinner     4
53        9.94  1.56  Male     No   Sun  Dinner     2
81       16.66  3.40  Male     No  Thur   Lunch     2
84       15.98  2.03  Male     No  Thur   Lunch     2)

In [36]:
for smoke_group in grouped:
    print('그룹명:',smoke_group[0])
    print(smoke_group[1])

그룹명: Yes
     total_bill   tip     sex smoker   day    time  size
173       31.85  3.18    Male    Yes   Sun  Dinner     2
80        19.44  3.00    Male    Yes  Thur   Lunch     2
56        38.01  3.00    Male    Yes   Sat  Dinner     4
192       28.44  2.56    Male    Yes  Thur   Lunch     2
100       11.35  2.50  Female    Yes   Fri  Dinner     2
그룹명: No
    total_bill   tip   sex smoker   day    time  size
42       13.94  3.06  Male     No   Sun  Dinner     2
13       18.43  3.00  Male     No   Sun  Dinner     4
53        9.94  1.56  Male     No   Sun  Dinner     2
81       16.66  3.40  Male     No  Thur   Lunch     2
84       15.98  2.03  Male     No  Thur   Lunch     2

In [39]:
smoker_day =tips_10.groupby(['smoker','day'])
group_avg = smoker_day.mean()
group_avg

             total_bill    tip  size
smoker day
Yes    Thur         NaN    NaN   NaN
       Fri      40.1700  4.730   4.0
       Sat          NaN    NaN   NaN
       Sun      32.5450  2.775   3.5
No     Thur     20.2700  2.830   2.0
       Fri          NaN    NaN   NaN
       Sat      17.7100  2.750   3.5
       Sun      23.4675  3.915   3.5

In [42]:
print(type(group_avg))
print(group_avg.columns)

<class 'pandas.core.frame.DataFrame'>
Index(['total_bill', 'tip', 'size'], dtype='object')

In [43]:
##그룹 오브젝트 멀티인데스에서 값조회

In [45]:
group_avg.loc['Yes']

      total_bill    tip  size
day
Thur         NaN    NaN   NaN
Fri       40.170  4.730   4.0
Sat          NaN    NaN   NaN
Sun       32.545  2.775   3.5

In [46]:
group_avg.loc['Yes','Fri']

total_bill    40.17
tip            4.73
size           4.00
Name: (Yes, Fri), dtype: float64

In [48]:
group_avg.loc[('Yes','Fri'),:]

total_bill    40.17
tip            4.73
size           4.00
Name: (Yes, Fri), dtype: float64

In [51]:
group_method = tips_10.groupby(['smoker','day']).mean().reset_index()
group_method

  smoker   day  total_bill    tip  size
0    Yes  Thur         NaN    NaN   NaN
1    Yes   Fri     40.1700  4.730   4.0
2    Yes   Sat         NaN    NaN   NaN
3    Yes   Sun     32.5450  2.775   3.5
4     No  Thur     20.2700  2.830   2.0
5     No   Fri         NaN    NaN   NaN
6     No   Sat     17.7100  2.750   3.5
7     No   Sun     23.4675  3.915   3.5

In [52]:
group_param=tips_10.groupby(['smoker','day'],as_index=False).mean()

In [53]:
group_param

  smoker   day  total_bill    tip  size
0    Yes  Thur         NaN    NaN   NaN
1    Yes   Fri     40.1700  4.730   4.0
2    Yes   Sat         NaN    NaN   NaN
3    Yes   Sun     32.5450  2.775   3.5
4     No  Thur     20.2700  2.830   2.0
5     No   Fri         NaN    NaN   NaN
6     No   Sat     17.7100  2.750   3.5
7     No   Sun     23.4675  3.915   3.5